# Pandas

- 시리즈 (Series)
- 데이터프레임 (DataFrame)
- 누락된 데이터 처리
- Groupby
- 연산자
- 입출력

---

### 1. 시리즈 (Series )

- pandas에서 1차원 데이터 타입
- class로 만들어져있음
- List만 가지고는 연산이 어렵기 때문에 이를 보완하고자 만들어짐

In [1]:
# import package
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
# dataset
lb = ['a', 'b', 'c']
ls = [10, 20, 30]
dic = {'a':10, 'b':20, 'c':30}

#### 1.1 리스트로 시리즈 만들기

In [3]:
pd.Series(data = ls, index = lb)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(ls, lb)

a    10
b    20
c    30
dtype: int64

#### 1.2 딕셔너리로 시리즈 만들기

In [5]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

#### 1.3 시리즈 데이터는 무조건 숫자형? No

In [6]:
pd.Series(data = lb)

0    a
1    b
2    c
dtype: object

#### 1.4 인덱스 사용하기

In [7]:
ser1 = pd.Series(ls, lb)
ser1

a    10
b    20
c    30
dtype: int64

In [8]:
ser1['a']

10

In [9]:
ser2 = pd.Series([10, 20, 30, 40, 50], ['a', 'c', 'd', 'e', 'f'])
ser2

a    10
c    20
d    30
e    40
f    50
dtype: int64

In [10]:
# index가 일치하는 값들만 연산, 나머지는 NaN값
ser1 + ser2

a    20.0
b     NaN
c    50.0
d     NaN
e     NaN
f     NaN
dtype: float64

---

### 2. DataFrame (데이터프레임)

In [11]:
np.random.seed(2) # 알아서 랜덤 씨앗을 달라는 의미
data = randn(5, 4)
data

array([[-0.41675785, -0.05626683, -2.1361961 ,  1.64027081],
       [-1.79343559, -0.84174737,  0.50288142, -1.24528809],
       [-1.05795222, -0.90900761,  0.55145404,  2.29220801],
       [ 0.04153939, -1.11792545,  0.53905832, -0.5961597 ],
       [-0.0191305 ,  1.17500122, -0.74787095,  0.00902525]])

In [12]:
df = pd.DataFrame(data, index = 'A B C D E'.split(), columns = 'x1 x2 x3 x4'.split())
df

         x1        x2        x3        x4
A -0.416758 -0.056267 -2.136196  1.640271
B -1.793436 -0.841747  0.502881 -1.245288
C -1.057952 -0.909008  0.551454  2.292208
D  0.041539 -1.117925  0.539058 -0.596160
E -0.019130  1.175001 -0.747871  0.009025

#### 2.1 부분 선택

In [13]:
# colums 추출시 사용
print(df['x1'])
print('type:', type(df['x1']))

A   -0.416758
B   -1.793436
C   -1.057952
D    0.041539
E   -0.019130
Name: x1, dtype: float64
type: <class 'pandas.core.series.Series'>

In [14]:
df[['x2', 'x4']]
# 왜 대괄호를 2개 쓰지? 두개 이상의 컬럼을 선택하려면 두개의 변수를 리스트화해야 함

         x2        x4
A -0.056267  1.640271
B -0.841747 -1.245288
C -0.909008  2.292208
D -1.117925 -0.596160
E  1.175001  0.009025

#### 2.2 새로운 컬럼 생성

In [15]:
df['x5'] = df['x2'] + df['x3']
df

         x1        x2        x3        x4        x5
A -0.416758 -0.056267 -2.136196  1.640271 -2.192463
B -1.793436 -0.841747  0.502881 -1.245288 -0.338866
C -1.057952 -0.909008  0.551454  2.292208 -0.357554
D  0.041539 -1.117925  0.539058 -0.596160 -0.578867
E -0.019130  1.175001 -0.747871  0.009025  0.427130

#### 2.3 컬럼 삭제

In [16]:
df.drop('x5', axis = 1) # axis = 1은 1번째 축(colum)을 기준으로 drop하라는 의미

         x1        x2        x3        x4
A -0.416758 -0.056267 -2.136196  1.640271
B -1.793436 -0.841747  0.502881 -1.245288
C -1.057952 -0.909008  0.551454  2.292208
D  0.041539 -1.117925  0.539058 -0.596160
E -0.019130  1.175001 -0.747871  0.009025

In [17]:
df.drop('x5', axis = 1, inplace = True) # inplace = True는 수정된 내용을 저장
df

         x1        x2        x3        x4
A -0.416758 -0.056267 -2.136196  1.640271
B -1.793436 -0.841747  0.502881 -1.245288
C -1.057952 -0.909008  0.551454  2.292208
D  0.041539 -1.117925  0.539058 -0.596160
E -0.019130  1.175001 -0.747871  0.009025

In [18]:
df.drop('E', axis = 0)

         x1        x2        x3        x4
A -0.416758 -0.056267 -2.136196  1.640271
B -1.793436 -0.841747  0.502881 -1.245288
C -1.057952 -0.909008  0.551454  2.292208
D  0.041539 -1.117925  0.539058 -0.596160

#### 2.4 열 (row) 선택

In [19]:
df.loc['A'] # loc는 인덱스를 선택

x1   -0.416758
x2   -0.056267
x3   -2.136196
x4    1.640271
Name: A, dtype: float64

In [20]:
df.iloc[0] # iloc에서 i는 인덱스라 생각

x1   -0.416758
x2   -0.056267
x3   -2.136196
x4    1.640271
Name: A, dtype: float64

In [21]:
df.loc['B','x3'] #[row, column]

0.5028814171580428

In [22]:
df.loc[['A', 'B'], ['x2', 'x3']]

         x2        x3
A -0.056267 -2.136196
B -0.841747  0.502881

#### 2.5 조건 선택

In [23]:
df

         x1        x2        x3        x4
A -0.416758 -0.056267 -2.136196  1.640271
B -1.793436 -0.841747  0.502881 -1.245288
C -1.057952 -0.909008  0.551454  2.292208
D  0.041539 -1.117925  0.539058 -0.596160
E -0.019130  1.175001 -0.747871  0.009025

In [24]:
df > 0 # True/False로 나타남 (boolean)

      x1     x2     x3     x4
A  False  False  False   True
B  False  False   True  False
C  False  False   True   True
D   True  False   True  False
E  False   True  False   True

In [25]:
df[df> 0] # True인 데이터만 실제 값을 표시

         x1        x2        x3        x4
A       NaN       NaN       NaN  1.640271
B       NaN       NaN  0.502881       NaN
C       NaN       NaN  0.551454  2.292208
D  0.041539       NaN  0.539058       NaN
E       NaN  1.175001       NaN  0.009025

In [26]:
df[df['x1']>0] # x1이 0보다 큰 행(row)을 출력

         x1        x2        x3       x4
D  0.041539 -1.117925  0.539058 -0.59616

In [27]:
df[df['x1']<0][['x3', 'x4']] # x1이 0보다 작은 행에서 x3, x4를 추출

         x3        x4
A -2.136196  1.640271
B  0.502881 -1.245288
C  0.551454  2.292208
E -0.747871  0.009025

#### 2.6 인덱스 관련 추가사항

In [28]:
# 예전 인덱스는 컬럼으로 바꿈
df = df.reset_index()
df

  index        x1        x2        x3        x4
0     A -0.416758 -0.056267 -2.136196  1.640271
1     B -1.793436 -0.841747  0.502881 -1.245288
2     C -1.057952 -0.909008  0.551454  2.292208
3     D  0.041539 -1.117925  0.539058 -0.596160
4     E -0.019130  1.175001 -0.747871  0.009025

In [29]:
New_idx = '1 2 3 4 5'.split()
New_idx

['1', '2', '3', '4', '5']

In [30]:
df['idx'] = New_idx # 새로운 column생성
df = df.set_index('idx') # 생성된 컬럼을 바탕으로 재정의
df

    index        x1        x2        x3        x4
idx
1       A -0.416758 -0.056267 -2.136196  1.640271
2       B -1.793436 -0.841747  0.502881 -1.245288
3       C -1.057952 -0.909008  0.551454  2.292208
4       D  0.041539 -1.117925  0.539058 -0.596160
5       E -0.019130  1.175001 -0.747871  0.009025

---

### 3. 누락된 데이터 처리

: 주식 데이터의 경우는 버리는게 정답

In [31]:
df = pd.DataFrame({'A': [1, 2, np.nan],
                   'B': [5, np.nan, np.nan],
                   'C': [1, 2, 3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
# nan값 버리기 - dropna
df.dropna() # row 살리기

     A    B  C
0  1.0  5.0  1

In [33]:
df.dropna(axis = 1) # column 살리기

   C
0  1
1  2
2  3

In [34]:
df.dropna(thresh=2) # nan값이 2개 이상인 row를 버리기

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [35]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

---

### 4. Groupby

In [36]:
data = {'회사': ['구글', '구글', '애플', '애플', '아마존', '아마존'],
        '이름': ['김씨', '이씨', '박씨', '최씨', '장씨', '마씨'], 
        '매출': [200, 120, 340, 125, 240, 350]}

df = pd.DataFrame(data)
df

    회사  이름   매출
0   구글  김씨  200
1   구글  이씨  120
2   애플  박씨  340
3   애플  최씨  125
4  아마존  장씨  240
5  아마존  마씨  350

In [37]:
df.groupby('회사') # class를 만들어준것에 불과

In [38]:
df.groupby('회사').mean()

        매출
회사
구글   160.0
아마존  295.0
애플   232.5

In [39]:
df.groupby('회사').std()

             매출
회사
구글    56.568542
아마존   77.781746
애플   152.027958

In [40]:
df.groupby('회사').describe() # 간단한 통계값

       매출
    count   mean         std    min     25%    50%     75%    max
회사
구글    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
아마존   2.0  295.0   77.781746  240.0  267.50  295.0  322.50  350.0
애플    2.0  232.5  152.027958  125.0  178.75  232.5  286.25  340.0

---

### 5. 연산자

In [41]:
df = pd.DataFrame({'col1': [1, 2, 3, 4],
                   'col2': [11, 22, 33, 33],
                   'col3': ['abc', 'def', 'ghi', 'xyz']})
df

   col1  col2 col3
0     1    11  abc
1     2    22  def
2     3    33  ghi
3     4    33  xyz

#### 5.1 unique

In [42]:
df['col2'].unique() # 중복값 제거

array([11, 22, 33])

In [43]:
df['col2'].nunique() # unique한 데이터 갯수

3

In [44]:
df['col2'].value_counts() # 각 데이터별 빈도수

33    2
11    1
22    1
Name: col2, dtype: int64

#### 5.2 데이터 값으로 선택

In [45]:
namedf = df[(df['col1']>2) & (df['col2']==33)]
namedf

   col1  col2 col3
2     3    33  ghi
3     4    33  xyz

#### 5.3 apply - 함수 적용

In [46]:
def square(x):
    return x ** 2

In [47]:
df['col1'].apply(square) # 각 원소별로 square 함수를 실행

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [48]:
df['col3'].apply(len) # 각 원소별 문자길이 추출 (문자형)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [49]:
df['col1'].sum() # col1 전체 합

10

In [50]:
df.sum(axis = 1) # sum일때는 axis가 반대

0    12
1    24
2    36
3    37
dtype: int64

#### 5.4 컬럼 삭제 (영구적)

In [51]:
del df['col1']
df

   col2 col3
0    11  abc
1    22  def
2    33  ghi
3    33  xyz

#### 5.5 컬럼명과 인덱스명

In [52]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [53]:
df.columns = ['col2', 'col3']
df

   col2 col3
0    11  abc
1    22  def
2    33  ghi
3    33  xyz

In [54]:
df.index

RangeIndex(start=0, stop=4, step=1)

#### 5.6 정렬

In [55]:
df.sort_values(by = 'col3', inplace = False)

   col2 col3
0    11  abc
1    22  def
2    33  ghi
3    33  xyz

#### 5.7 비어있는 값 체크

In [56]:
df = pd.DataFrame({'A': [1, 2, np.nan],
                   'B': [5, np.nan, np.nan],
                   'C': [1, 2, 3]})

df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

---

### 6. 데이터 입력 / 출력

#### 6.1 csv

In [57]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [58]:
df.to_csv('example2', index = False)

#### 6.2 Excel

pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1')

df.to_excel('Excel_Sample2.xlsx', sheet_name = 'Sheet1')

#### 6.3 HTML

In [59]:
df = pd.read_html('http://finance.naver.com/item/sise.nhn?code=089030') # 자동 파싱, 별로 좋지 않음
df

[                    0                                        1  \
 0  전일  14,950  14,950  고가  15,20015,200  (상한가  19,40019,400  )
 1    시가  14,80014,800        저가  14,65014,650  (하한가  10,500  )

                         2
 0     거래량  94,968  94,968
 1  거래대금  1,425  1,425  백만  ,           0        1       2         3
 0       현재가    14950    매도호가     15050
 1      전일대비        0    매수호가     14950
 2    등락률(%)    0.00%     전일가     14950
 3       거래량    94968      시가     14800
 4   거래대금(천)     1425      고가     15200
 5       액면가     500원      저가     14650
 6       NaN      NaN     NaN       NaN
 7       상한가    19400    전일상한     19650
 8       하한가    10500    전일하한     10650
 9       PER     7.13     EPS      2096
 10   52주 최고    22300  52주 최저     12100
 11     시가총액  2,815억원   상장주식수  18827732
 12    외국인현재  2,020천주     자본금   9,477백만,        0      1   2      3     4
 0   매도잔량   매도호가 NaN   매수호가  매수잔량
 1    NaN    NaN NaN    NaN   NaN
 2    155  15250 NaN    NaN   NaN
 3    826  15200 NaN    NaN   NaN
 4    678  15150 NaN    NaN   NaN
 5    831  15100 NaN    NaN   NaN
 6    234  15050 NaN    NaN   NaN
 7    NaN    NaN NaN    NaN   NaN
 8    NaN    NaN NaN    NaN   NaN
 9    NaN    NaN NaN    NaN   NaN
 10   NaN    NaN NaN  14950  1419
 11   NaN    NaN NaN  14900  2064
 12   NaN    NaN NaN  14850  1883
 13   NaN    NaN NaN  14800   289
 14   NaN    NaN NaN  14750    20
 15   NaN    NaN NaN    NaN   NaN,       0     1      2
 0  6706  잔량합계  11717,           0                   1
 0      시가총액           2,815  억원
 1    시가총액순위            코스닥 196위
 2     상장주식수            18827732
 3  액면가l매매단위         500원  l  1주
 4  주총일l전자투표  2018.03.26  l  미도입,              0         1
 0  외국인한도주식수(A)  18827732
 1  외국인보유주식수(B)   2020484
 2  외국인소진율(B/A)    10.73%,            0                  1
 0  투자의견l목표주가  4.00매수  l  26,317
 1   52주최고l최저  22,300  l  12,100,                  0                 1
 0  PERlEPS(WISEfn)  7.13배  l  2,096원,           0       1
 0  동일업종 PER   7.18배
 1  동일업종 등락률  +0.51%,        0          1      2
 0   매도잔량  호가(20분지연)   매수잔량
 1    NaN        NaN    NaN
 2   1257      15500    NaN
 3     73      15450    NaN
 4   1306      15400    NaN
 5    769      15350    NaN
 6    577      15300    NaN
 7    155      15250    NaN
 8    826      15200    NaN
 9    678      15150    NaN
 10   831      15100    NaN
 11   234      15050    NaN
 12   NaN        NaN    NaN
 13   NaN      14950   1419
 14   NaN      14900   2064
 15   NaN      14850   1883
 16   NaN      14800    289
 17   NaN      14750     20
 18   NaN      14700   2711
 19   NaN      14650   1033
 20   NaN      14600    441
 21   NaN      14550    406
 22   NaN      14500   1451
 23   NaN        NaN    NaN
 24  6706       잔량합계  11717,          업체명     거래량         전일비
 0        업체명     거래량         전일비
 1      NAVER  735000  하향  13,000
 2    LG디스플레이   18200     하향  600
 3       현대로템   29200   하향  1,050
 4       삼성전자   47000     상향  350
 5       셀트리온  301000   상향  5,000
 6        NaN     NaN         NaN
 7       동양철관    2770     하향  160
 8      POSCO  342000  하향  12,000
 9       현대건설   60400   하향  2,600
 10    현대건설기계  145000          보합
 11  삼성에스디에..  205000   하향  1,000,        업체명     거래량        전일비
 0      업체명     거래량        전일비
 1       신텍    1580         보합
 2    대아티아이    8050    하향  990
 3     EDGC   11100  상향  2,100
 4     네이처셀   17550    상향  350
 5       빅텍    2965    상향  115
 6      NaN     NaN        NaN
 7      아난티    9200  하향  1,000
 8   텔콘RF제약   10450    상향  200
 9     큐브엔터    3370    상향  195
 10    파버나인    8240    상향  550
 11      휴젤  502400  하향  1,300]